modm-ext/archive-stmicro-svd/header_stm32l4r5agi6.svd
      <register>
        <name>BGCLUT.42</name>
        <addressOffset>0x8a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.43</name>
        <addressOffset>0x8ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.44</name>
        <addressOffset>0x8b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.45</name>
        <addressOffset>0x8b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.46</name>
        <addressOffset>0x8b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.47</name>
        <addressOffset>0x8bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.48</name>
        <addressOffset>0x8c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.49</name>
        <addressOffset>0x8c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.50</name>
        <addressOffset>0x8c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.51</name>
        <addressOffset>0x8cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.52</name>
        <addressOffset>0x8d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.53</name>
        <addressOffset>0x8d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.54</name>
        <addressOffset>0x8d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.55</name>
        <addressOffset>0x8dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.56</name>
        <addressOffset>0x8e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.57</name>
        <addressOffset>0x8e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.58</name>
        <addressOffset>0x8e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.59</name>
        <addressOffset>0x8ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.60</name>
        <addressOffset>0x8f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.61</name>
        <addressOffset>0x8f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.62</name>
        <addressOffset>0x8f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.63</name>
        <addressOffset>0x8fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.64</name>
        <addressOffset>0x900</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.65</name>
        <addressOffset>0x904</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.66</name>
        <addressOffset>0x908</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.67</name>
        <addressOffset>0x90c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.68</name>
        <addressOffset>0x910</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.69</name>
        <addressOffset>0x914</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.70</name>
        <addressOffset>0x918</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.71</name>
        <addressOffset>0x91c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.72</name>
        <addressOffset>0x920</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.73</name>
        <addressOffset>0x924</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.74</name>
        <addressOffset>0x928</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.75</name>
        <addressOffset>0x92c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.76</name>
        <addressOffset>0x930</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.77</name>
        <addressOffset>0x934</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.78</name>
        <addressOffset>0x938</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.79</name>
        <addressOffset>0x93c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.80</name>
        <addressOffset>0x940</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.81</name>
        <addressOffset>0x944</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.82</name>
        <addressOffset>0x948</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.83</name>
        <addressOffset>0x94c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.84</name>
        <addressOffset>0x950</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.85</name>
        <addressOffset>0x954</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.86</name>
        <addressOffset>0x958</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.87</name>
        <addressOffset>0x95c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.88</name>
        <addressOffset>0x960</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.89</name>
        <addressOffset>0x964</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.90</name>
        <addressOffset>0x968</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.91</name>
        <addressOffset>0x96c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.92</name>
        <addressOffset>0x970</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.93</name>
        <addressOffset>0x974</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.94</name>
        <addressOffset>0x978</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.95</name>
        <addressOffset>0x97c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.96</name>
        <addressOffset>0x980</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.97</name>
        <addressOffset>0x984</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.98</name>
        <addressOffset>0x988</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.99</name>
        <addressOffset>0x98c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.100</name>
        <addressOffset>0x990</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.101</name>
        <addressOffset>0x994</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.102</name>
        <addressOffset>0x998</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.103</name>
        <addressOffset>0x99c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.104</name>
        <addressOffset>0x9a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.105</name>
        <addressOffset>0x9a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.106</name>
        <addressOffset>0x9a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.107</name>
        <addressOffset>0x9ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.108</name>
        <addressOffset>0x9b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.109</name>
        <addressOffset>0x9b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.110</name>
        <addressOffset>0x9b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.111</name>
        <addressOffset>0x9bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.112</name>
        <addressOffset>0x9c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.113</name>
        <addressOffset>0x9c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.114</name>
        <addressOffset>0x9c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.115</name>
        <addressOffset>0x9cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.116</name>
        <addressOffset>0x9d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.117</name>
        <addressOffset>0x9d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.118</name>
        <addressOffset>0x9d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.119</name>
        <addressOffset>0x9dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.120</name>
        <addressOffset>0x9e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.121</name>
        <addressOffset>0x9e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.122</name>
        <addressOffset>0x9e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.123</name>
        <addressOffset>0x9ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.124</name>
        <addressOffset>0x9f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.125</name>
        <addressOffset>0x9f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.126</name>
        <addressOffset>0x9f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.127</name>
        <addressOffset>0x9fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.128</name>
        <addressOffset>0xa00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.129</name>
        <addressOffset>0xa04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.130</name>
        <addressOffset>0xa08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.131</name>
        <addressOffset>0xa0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.132</name>
        <addressOffset>0xa10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.133</name>
        <addressOffset>0xa14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.134</name>
        <addressOffset>0xa18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.135</name>
        <addressOffset>0xa1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.136</name>
        <addressOffset>0xa20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.137</name>
        <addressOffset>0xa24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.138</name>
        <addressOffset>0xa28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.139</name>
        <addressOffset>0xa2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.140</name>
        <addressOffset>0xa30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.141</name>
        <addressOffset>0xa34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.142</name>
        <addressOffset>0xa38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.143</name>
        <addressOffset>0xa3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.144</name>
        <addressOffset>0xa40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.145</name>
        <addressOffset>0xa44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.146</name>
        <addressOffset>0xa48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.147</name>
        <addressOffset>0xa4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.148</name>
        <addressOffset>0xa50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.149</name>
        <addressOffset>0xa54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.150</name>
        <addressOffset>0xa58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.151</name>
        <addressOffset>0xa5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.152</name>
        <addressOffset>0xa60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.153</name>
        <addressOffset>0xa64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.154</name>
        <addressOffset>0xa68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.155</name>
        <addressOffset>0xa6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.156</name>
        <addressOffset>0xa70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.157</name>
        <addressOffset>0xa74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.158</name>
        <addressOffset>0xa78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.159</name>
        <addressOffset>0xa7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.160</name>
        <addressOffset>0xa80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.161</name>
        <addressOffset>0xa84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.162</name>
        <addressOffset>0xa88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.163</name>
        <addressOffset>0xa8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.164</name>
        <addressOffset>0xa90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.165</name>
        <addressOffset>0xa94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.166</name>
        <addressOffset>0xa98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.167</name>
        <addressOffset>0xa9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.168</name>
        <addressOffset>0xaa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.169</name>
        <addressOffset>0xaa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.170</name>
        <addressOffset>0xaa8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.171</name>
        <addressOffset>0xaac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.172</name>
        <addressOffset>0xab0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.173</name>
        <addressOffset>0xab4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.174</name>
        <addressOffset>0xab8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.175</name>
        <addressOffset>0xabc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.176</name>
        <addressOffset>0xac0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.177</name>
        <addressOffset>0xac4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.178</name>
        <addressOffset>0xac8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.179</name>
        <addressOffset>0xacc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.180</name>
        <addressOffset>0xad0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.181</name>
        <addressOffset>0xad4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.182</name>
        <addressOffset>0xad8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.183</name>
        <addressOffset>0xadc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.184</name>
        <addressOffset>0xae0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.185</name>
        <addressOffset>0xae4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.186</name>
        <addressOffset>0xae8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.187</name>
        <addressOffset>0xaec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.188</name>
        <addressOffset>0xaf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.189</name>
        <addressOffset>0xaf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.190</name>
        <addressOffset>0xaf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.191</name>
        <addressOffset>0xafc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.192</name>
        <addressOffset>0xb00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.193</name>
        <addressOffset>0xb04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.194</name>
        <addressOffset>0xb08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.195</name>
        <addressOffset>0xb0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.196</name>
        <addressOffset>0xb10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.197</name>
        <addressOffset>0xb14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.198</name>
        <addressOffset>0xb18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.199</name>
        <addressOffset>0xb1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.200</name>
        <addressOffset>0xb20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.201</name>
        <addressOffset>0xb24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.202</name>
        <addressOffset>0xb28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.203</name>
        <addressOffset>0xb2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.204</name>
        <addressOffset>0xb30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.205</name>
        <addressOffset>0xb34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.206</name>
        <addressOffset>0xb38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.207</name>
        <addressOffset>0xb3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.208</name>
        <addressOffset>0xb40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.209</name>
        <addressOffset>0xb44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.210</name>
        <addressOffset>0xb48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.211</name>
        <addressOffset>0xb4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.212</name>
        <addressOffset>0xb50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.213</name>
        <addressOffset>0xb54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.214</name>
        <addressOffset>0xb58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.215</name>
        <addressOffset>0xb5c</addressOffset>
        <size>0x20</size>
      </register>
